<a href="https://colab.research.google.com/github/earandir/DataAnalysis/blob/main/Modulo03/Sesion07/M03S07R02manipulacion_de_strings.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## Reto 2: Manipulación de Strings

### 1. Objetivos:
    - Practicar manipular `strings` usando métodos como `split`, `title`, `strip, etc.
 
---
    
### 2. Desarrollo:

In [1]:
import pandas as pd

In [2]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

---
---

In [3]:
data = '/content/drive/MyDrive/DataAnalysis/new_york_times_bestsellers-clean.csv'

In [4]:
df_reto_2 = pd.read_csv(data, index_col=0)

In [6]:
# examina
df_reto_2.head(3)

                      id_name  ...                            orbit_class_description
0  2154652-154652 (2004 EP20)  ...    Near-Earth-asteroid-orbits-similar-to-that-o...
1           3153509-(2003 HM)  ...    Near-Earth-asteroid-orbits-which-cross-the-E...
3          3837644-(2019 AY3)  ...    Near-Earth-asteroid-orbits-similar-to-that-o...

[3 rows x 10 columns]

#### a) Limpiando texto

Vamos a trabajar en la versión del dataset que guardaste en el reto pasado. Las acciones que tienes que tomar en este Reto son las siguientes:

1. Reemplaza los guiones en las `strings` de la columna `orbit_class_description` por espacios.

In [11]:
# remplaza
df_reto_2['orbit_class_description'].str.replace('-', ' ')

0        Near Earth asteroid orbits similar to that o...
1        Near Earth asteroid orbits which cross the E...
3        Near Earth asteroid orbits similar to that o...
4       Near Earth asteroid orbits similar to that of...
5       An asteroid orbit contained entirely within t...
                             ...
327     Near Earth asteroid orbits similar to that of...
328      Near Earth asteroid orbits similar to that o...
329      Near Earth asteroid orbits which cross the E...
330     An asteroid orbit contained entirely within t...
331      Near Earth asteroid orbits similar to that o...
Name: orbit_class_description, Length: 301, dtype: object

In [12]:
# reasigna
df_reto_2['orbit_class_description'] = df_reto_2['orbit_class_description'].str.replace('-', ' ')

df_reto_2["orbit_class_description"].loc[0]

'  Near Earth asteroid orbits similar to that of 2062 Aten  '

2. Elimina los espacios vacíos al principio y final de las `strings` de la misma columna.

In [13]:
# elimina espacios en blanco
df_reto_2['orbit_class_description'] = df_reto_2['orbit_class_description'].str.strip()

df_reto_2["orbit_class_description"].loc[0]

'Near Earth asteroid orbits similar to that of 2062 Aten'

3. Hay una columna llamada `id_name` que contiene el 'id' y el nombre de cada objeto separados por un guión. Separa estos datos en dos columnas llamadas `id` y `name`.

In [18]:
# separa por guiones
df_reto_2[['id', 'name']] = df_reto_2['id_name'].str.split('-', expand=True)

df_reto_2.head(3)

                      id_name  ...                name
0  2154652-154652 (2004 EP20)  ...  154652 (2004 EP20)
1           3153509-(2003 HM)  ...           (2003 HM)
3          3837644-(2019 AY3)  ...          (2019 AY3)

[3 rows x 12 columns]

4. Haz que las `strings` de la columna `orbiting_body` empiecen con mayúscula.

In [26]:
# cambia a títulos
df_reto_2["orbiting_body"].str.capitalize()

0      Earth
1      Earth
3      Earth
4      Earth
5      Earth
       ...
327    Earth
328    Earth
329    Earth
330    Earth
331    Earth
Name: orbiting_body, Length: 301, dtype: object

5. Asigna el `DataFrame` resultante a la variable `df_reto_2`.

In [27]:
df_reto_2["orbiting_body"] = df_reto_2["orbiting_body"].str.capitalize()

df_reto_2["orbiting_body"]

0      Earth
1      Earth
3      Earth
4      Earth
5      Earth
       ...
327    Earth
328    Earth
329    Earth
330    Earth
331    Earth
Name: orbiting_body, Length: 301, dtype: object

6. Guarda tu resultado en un archivo .csv.

In [29]:
# guarda en el archivo objetos_cercanos_2.csv
path = '/content/drive/MyDrive/DataAnalysis/objetos_cercanos_2.csv'
df_reto_2.to_csv(path)

¡Compara con el Ingeniero de Datos de tu confianza y si coinciden entonces envíen su respuesta!